Информационная_база/src/InformationRegisters/ПредельнаяВеличинаБазыСтраховыхВзносов/ПредельнаяВеличинаБазыСтраховыхВзносов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПредельнаяВеличинаБазыСтраховыхВзносов</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <resources>
    <name>РазмерПФР</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РазмерФСС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РазмерФОМС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
</mdclass:InformationRegister>

Информационная_база/src/InformationRegisters/ПредельнаяВеличинаБазыСтраховыхВзносов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура УстановитьПредельнуюВеличинуБазыСтраховыхВзносов() Экспорт
	
	НаборЗаписей = РегистрыСведений.ПредельнаяВеличинаБазыСтраховыхВзносов.СоздатьНаборЗаписей();
	НоваяСтрока = НаборЗаписей.Добавить();
	НоваяСтрока.Период = '20100101';
	НоваяСтрока.РазмерФСС = 415000;
	НоваяСтрока.РазмерПФР = 415000;
	НоваяСтрока.РазмерФОМС = 415000;
	НоваяСтрока = НаборЗаписей.Добавить();
	НоваяСтрока.Период = '20110101';
	НоваяСтрока.РазмерФСС = 463000;
	НоваяСтрока.РазмерПФР = 463000;
	НоваяСтрока.РазмерФОМС = 463000;
	НоваяСтрока = НаборЗаписей.Добавить();
	НоваяСтрока.Период = '20120101';
	НоваяСтрока.РазмерФСС = 512000;
	НоваяСтрока.РазмерПФР = 512000;
	НоваяСтрока.РазмерФОМС = 512000;
	НоваяСтрока = НаборЗаписей.Добавить();
	НоваяСтрока.Период = '20130101';
	НоваяСтрока.РазмерФСС = 568000;
	НоваяСтрока.РазмерПФР = 568000;
	НоваяСтрока.РазмерФОМС = 568000;
	НоваяСтрока = НаборЗаписей.Добавить();
	НоваяСтрока.Период = '20140101';
	НоваяСтрока.РазмерФСС = 624000;
	НоваяСтрока.РазмерПФР = 624000;
	НоваяСтрока.РазмерФОМС = 624000;
	НоваяСтрока = НаборЗаписей.Добавить();
	НоваяСтрока.Период = '20150101';
	НоваяСтрока.РазмерФСС = 670000;
	НоваяСтрока.РазмерПФР = 711000;
	
	НоваяСтрока = НаборЗаписей.Добавить();
	НоваяСтрока.Период = '20160101';
	НоваяСтрока.РазмерФСС = 718000;
	НоваяСтрока.РазмерПФР = 796000;
	
	НоваяСтрока = НаборЗаписей.Добавить();
	НоваяСтрока.Период = '20170101';
	НоваяСтрока.РазмерФСС = 755000;
	НоваяСтрока.РазмерПФР = 876000;
	
	НоваяСтрока = НаборЗаписей.Добавить();
	НоваяСтрока.Период = '20180101';
	НоваяСтрока.РазмерФСС = 815000;
	НоваяСтрока.РазмерПФР = 1021000;
	
	НоваяСтрока = НаборЗаписей.Добавить();
	НоваяСтрока.Период = '20190101';
	НоваяСтрока.РазмерФСС = 865000;
	НоваяСтрока.РазмерПФР = 1150000;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры
#КонецЕсли
